title: Meta Rule Lamdba Fonction on AWS
id: 345f61f8-caec-439b-a9d2-1684ca777ce2
correlation:
    type: temporal
    rules:
        - d914951b-52c8-485f-875e-86abab710c0b
        - 53baf6c8-e3a2-4769-8378-f20df75f550d
    group-by:
        - eventSource
    timespan: 5m
level: low
---
title: AWS Lambda Function Created
id: d914951b-52c8-485f-875e-86abab710c0b
status: experimental
description: Detects when an user creates or invokes a lambda function.
references:
    - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation/
author: Austin Songer @austinsonger
date: 2021-10-03
modified: 2023-03-24
tags:
    - attack.privilege-escalation
    - attack.t1078
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: lambda.amazonaws.com
        eventName: CreateFunction
    condition: selection
falsepositives:
    - Lambda Function created or invoked may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.
    - If known behavior is causing false positives, it can be exempted from the rule.
level: low
---
title: AWS Lambda Function Invoked
id: 53baf6c8-e3a2-4769-8378-f20df75f550d
status: experimental
description: Detects when an user creates or invokes a lambda function.
references:
    - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation/
author: Austin Songer @austinsonger
date: 2021-10-03
modified: 2023-03-24
tags:
    - attack.privilege-escalation
    - attack.t1078
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: lambda.amazonaws.com
        eventName: Invoke
    condition: selection
falsepositives:
    - Lambda Function created or invoked may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.
    - If known behavior is causing false positives, it can be exempted from the rule.
level: low
