title: Meta Rule Potential Backup Enumeration on AWS
id: 1e74380d-27f2-4058-9b93-da7e8112153b
correlation:
    type: event_count
    rules:
        - 76255e09-755e-4675-8b6b-dbce9842cd2a
    group-by:
        - eventSource
    timespan: 10m
    condition:
        gt: 5
level: medium
---
title: Potential Backup Enumeration on AWS
id: 76255e09-755e-4675-8b6b-dbce9842cd2a
status: experimental
description: Detects potential enumeration activity targeting an AWS instance backups
references:
    - https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/
author: Janantha Marasinghe
date: 2022-12-13
modified: 2023-03-24
tags:
    - attack.discovery
    - attack.t1580
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'ec2.amazonaws.com'
        eventName:
            - 'GetPasswordData'
            - 'GetEbsEncryptionByDefault'
            - 'GetEbsDefaultKmsKeyId'
            - 'GetBucketReplication'
            - 'DescribeVolumes'
            - 'DescribeVolumesModifications'
            - 'DescribeSnapshotAttribute'
            - 'DescribeSnapshotTierStatus'
            - 'DescribeImages'
    condition: selection
falsepositives:
    - Unknown
level: medium
