title: Meta Rule AWS EC2 Download Userdata
id: 2c3c24a2-4240-4a5f-9f6f-2dea6f1fb174
correlation:
    type: event_count
    rules:
        - 26ff4080-194e-47e7-9889-ef7602efed0c
    group-by:
        - eventSource
    timespan: 30m
    condition:
        gt: 10
level: medium
---
title: AWS EC2 Download Userdata
id: 26ff4080-194e-47e7-9889-ef7602efed0c
status: experimental
description: Detects bulk downloading of User Data associated with AWS EC2 instances. Instance User Data may include installation scripts and hard-coded secrets for deployment.
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/ec2__download_userdata/main.py
author: faloker
date: 2020-02-11
modified: 2023-03-24
tags:
    - attack.exfiltration
    - attack.t1020
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: ec2.amazonaws.com
        requestParameters.attribute: userData
        eventName: DescribeInstanceAttribute
    condition: selection_source
falsepositives:
    - Assets management software like device42
level: medium
