title: Meta Rule Multiple Suspicious Resp Codes Caused by Single Client
id: 5d8f4722-3396-4612-b62f-9d16603fb97d
correlation:
    type: event_count
    rules:
        - 6fdfc796-06b3-46e8-af08-58f3505318af
    group-by:
        - clientip
    timespan: 10m
    condition:
        gt: 10
level: medium
---
title: Multiple Suspicious Resp Codes Caused by Single Client
id: 6fdfc796-06b3-46e8-af08-58f3505318af
status: unsupported
description: Detects possible exploitation activity or bugs in a web application
author: Thomas Patzke
date: 2017/02/19
modified: 2023/03/24
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: webserver
detection:
    selection:
        sc-status:
            - 400
            - 401
            - 403
            - 500
    condition: selection
fields:
    - client_ip
    - vhost
    - url
    - response
falsepositives:
    - Unstable application
    - Application that misuses the response codes
level: medium
