title: Meta Rule High TXT Records Requests Rate
id: 42816e16-d071-4e7f-8481-6ffdf6cae4c9
correlation:
    type: event_count
    rules:
        - f0a8cedc-1d22-4453-9c44-8d9f4ebd5d35
    group-by:
        - src_ip
    timespan: 1m
    condition:
        gt: 50
level: medium
---
title: High TXT Records Requests Rate
id: f0a8cedc-1d22-4453-9c44-8d9f4ebd5d35
status: unsupported
description: Extremely high rate of TXT record type DNS requests from host per short period of time. Possible result of Do-exfiltration tool execution
author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
modified: 2023/03/24
tags:
    - attack.exfiltration
    - attack.t1048.003
    - attack.command_and_control
    - attack.t1071.004
logsource:
    category: dns
detection:
    selection:
        record_type: 'TXT'
    condition: selection
falsepositives:
    - Legitimate high DNS TXT requests rate to domain name which should be added to whitelist
level: medium
