title: Meta Rule High NULL Records Requests Rate
id: a9c0ab1f-7dc1-4198-b050-15337f4ec7d8
correlation:
    type: event_count
    rules:
        - 44ae5117-9c44-40cf-9c7c-7edad385ca70
    group-by:
        - src_ip
    timespan: 1m
    condition:
        gt: 50
level: medium
---
title: High NULL Records Requests Rate
id: 44ae5117-9c44-40cf-9c7c-7edad385ca70
status: experimental
description: Extremely high rate of NULL record type DNS requests from host per short period of time. Possible result of iodine tool execution
author: Daniil Yugoslavskiy, oscd.community
date: 2019-10-24
modified: 2023-03-24
tags:
    - attack.exfiltration
    - attack.t1048.003
    - attack.command-and-control
    - attack.t1071.004
logsource:
    category: dns
detection:
    selection:
        record_type: 'NULL'
    condition: selection
falsepositives:
    - Legitimate high DNS NULL requests rate to domain name which should be added to whitelist
level: medium
