title: Meta Rule Possible DNS Tunneling
id: 7fab12cb-3e07-4596-a96d-eb678dccff54
correlation:
  type: value_count
  rules:
      - 1ec4b281-aa65-46a2-bdae-5fd830ed914e
  group-by:
      - parent_domain
  timespan: 1h
  condition:
      field: dns_query
      gt: 1000
level: medium
---
title: Possible DNS Tunneling
id: 1ec4b281-aa65-46a2-bdae-5fd830ed914e
status: experimental
description: Normally, DNS logs contain a limited amount of different dns queries for a single domain. This rule detects a high amount of queries for a single domain, which can be an indicator that DNS is used to transfer data.
references:
    - https://zeltser.com/c2-dns-tunneling/
    - https://patrick-bareiss.com/detect-c2-traffic-over-dns-using-sigma/
author: Patrick Bareiss
date: 2019-04-07
modified: 2023-03-24
tags:
    - attack.command-and-control
    - attack.t1071.004
    - attack.exfiltration
    - attack.t1048.003
logsource:
    category: dns
detection:
    selection:
        parent_domain: '*'
    condition: selection
falsepositives:
    - Valid software, which uses dns for transferring data
level: high
