title: Meta Rule High DNS Requests Rate - Firewall
id: 7380b975-7160-4a99-9a62-639371f5a9dd
correlation:
    type: event_count
    rules:
        - 51186749-7415-46be-90e5-6914865c825a
    group-by:
        - src_ip
    timespan: 1m
    condition:
        gt: 1000
level: medium
---
title: High DNS Requests Rate - Firewall
id: 51186749-7415-46be-90e5-6914865c825a
status: experimental
description: High DNS requests amount from host per short period of time
author: Daniil Yugoslavskiy, oscd.community
date: 2019-10-24
modified: 2023-03-24
tags:
    - attack.exfiltration
    - attack.t1048.003
    - attack.command-and-control
    - attack.t1071.004
logsource:
    category: firewall
detection:
    selection:
        dst_port: 53
    condition: selection
falsepositives:
    - Legitimate high DNS requests rate to domain name which should be added to whitelist
level: medium
