title: Meta Rule Failed Logins with Different Accounts from Single Source
id: df21cf21-21c2-4adf-9039-9fdd954f7858
correlation:
  type: value_count
  rules:
      - fc947f8e-ea81-4b14-9a7b-13f888f94e18
  group-by:
      - pam_rhost
  timespan: 24h
  condition:
      field: pam_user
      gt: 3
level: medium
---
title: Failed Logins with Different Accounts from Single Source - Linux
id: fc947f8e-ea81-4b14-9a7b-13f888f94e18
status: experimental
description: Detects suspicious failed logins with different user accounts from a single source system
author: Florian Roth (Nextron Systems)
date: 2017-02-16
modified: 2023-03-24
tags:
    - attack.credential-access
    - attack.t1110
logsource:
    product: linux
    service: auth
detection:
    selection:
        pam_message: authentication failure
        pam_user: '*'
        pam_rhost: '*'
    condition: selection
falsepositives:
    - Terminal servers
    - Jump servers
    - Workstations with frequently changing users
level: medium
