title: Meta Rule Potential CVE-2021-4034 Exploitation Attempt
id: 32b49bfd-e524-4212-b58d-b9feb5e7fd87
correlation:
    type: temporal # should be temporal_ordered
    rules:
        - 40a016ab-4f48-4eee-adde-bbf612695c53
        - 3f4efb10-b8e0-4253-9cbb-32d4b2ef53d0
    group-by:
        - computer
    timespan: 1m
level: high
---
title: Potential CVE-2021-4034 Exploitation Attempt - PROCTITLE
id: 40a016ab-4f48-4eee-adde-bbf612695c53
status: experimental
description: Detects exploitation attempt of the vulnerability described in CVE-2021-4034.
references:
    - https://github.com/berdav/CVE-2021-4034
    - https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4034
    - https://access.redhat.com/security/cve/CVE-2021-4034
author: Pawel Mazur
date: 2022-01-27
modified: 2023-03-24
tags:
    - attack.privilege-escalation
    - attack.t1068
logsource:
    product: linux
    service: auditd
detection:
    selection_proctitle:
        type: PROCTITLE
        proctitle: '(null)'
    condition: selection_proctitle
falsepositives:
    - Unknown
level: high
---
title: Potential CVE-2021-4034 Exploitation Attempt - SYSCALL
id: 3f4efb10-b8e0-4253-9cbb-32d4b2ef53d0
status: experimental
description: Detects exploitation attempt of the vulnerability described in CVE-2021-4034.
references:
    - https://github.com/berdav/CVE-2021-4034
    - https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4034
    - https://access.redhat.com/security/cve/CVE-2021-4034
author: Pawel Mazur
date: 2022-01-27
modified: 2023-03-24
tags:
    - attack.privilege-escalation
    - attack.t1068
logsource:
    product: linux
    service: auditd
detection:
    selection_syscall:
        type: SYSCALL
        comm: pkexec
        exe: '/usr/bin/pkexec'
    condition: selection_syscall
falsepositives:
    - Unknown
level: high