title: Meta Rule Use of Debugfs to Access a Raw Disk
id: 61320051-cefa-4784-a413-89288a485470
correlation:
    type: temporal
    rules:
        - fb0647d7-371a-4553-8e20-33bbbe122956
        - e33e10c1-e376-4dc5-906b-f37c0814d96b
    group-by:
        - computer
    timespan: 5m
level: medium
---
title: Use of Debugfs to Access a Raw Disk
id: fb0647d7-371a-4553-8e20-33bbbe122956
status: experimental
description: Detects access to a raw disk on a host to evade detection by security products.
references:
    - https://twitter.com/0xm1rch/status/1600857731073654784?s=20&t=MdrBPqv4hnBEfAJBayMCZA
    - https://github.com/Neo23x0/auditd/blob/master/audit.rules # required auditd config
author: Janantha Marasinghe
date: 2022-12-20
modified: 2023-03-24
tags:
    - attack.defense-evasion
    - attack.t1006
logsource:
    product: linux
    service: auditd
detection:
    selection_debugfs:
        type: 'EXECVE'
        a0: 'debugfs'
    condition: selection_debugfs
falsepositives:
    - Unknown
level: medium
---
title: Use of Tools to Access a Raw Disk
id: e33e10c1-e376-4dc5-906b-f37c0814d96b
status: experimental
description: Detects access to a raw disk on a host to evade detection by security products.
references:
    - https://twitter.com/0xm1rch/status/1600857731073654784?s=20&t=MdrBPqv4hnBEfAJBayMCZA
    - https://github.com/Neo23x0/auditd/blob/master/audit.rules # required auditd config
author: Janantha Marasinghe
date: 2022-12-20
modified: 2023-03-24
tags:
    - attack.defense-evasion
    - attack.t1006
logsource:
    product: linux
    service: auditd
detection:
    selection_tools:
        type: 'EXECVE'
        a0:
            - 'df'
            - 'lsblk'
            - 'pvs'
            - 'fdisk'
            - 'blkid'
            - 'parted'
            - 'hwinfo'
            - 'inxi'
    condition:  selection_tools
falsepositives:
    - Unknown
level: medium