title: Meta Rule CVE-2021-3156 Exploitation Attempt Bruteforcing
id: 9fd5dd72-715d-4fd0-bb7a-28818e7de022
correlation:
    type: event_count
    rules:
        - b9748c98-9ea7-4fdb-80b6-29bed6ba71d2
    group-by:
        - host
    timespan: 24h
    condition:
        gt: 50
level: medium
---
title: CVE-2021-3156 Exploitation Attempt Bruteforcing
id: b9748c98-9ea7-4fdb-80b6-29bed6ba71d2
related:
    - id: 5ee37487-4eb8-4ac2-9be1-d7d14cdc559f
      type: derived
status: experimental
description: |
  Detects exploitation attempt of vulnerability described in CVE-2021-3156.
  Alternative approach might be to look for flooding of auditd logs due to bruteforcing.
  required to trigger the heap-based buffer overflow.
references:
    - https://blog.qualys.com/vulnerabilities-research/2021/01/26/cve-2021-3156-heap-based-buffer-overflow-in-sudo-baron-samedit
author: Bhabesh Raj
date: 2021-02-01
modified: 2023-03-24
tags:
    - attack.privilege-escalation
    - attack.t1068
    - cve.2021-3156
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'SYSCALL'
        exe: '/usr/bin/sudoedit'
    condition: selection
falsepositives:
    - Unknown
level: high
