title: MEta Rule Brute Force
id: ef911a55-7e8b-4f9a-b655-9c05bbc97ee1
description: Detects many authentication failures from one source to one destination which is may indicate Brute Force activity
correlation:
  type: value_count
  rules:
      - 53c7cca0-2901-493a-95db-d00d6fcf0a37
  group-by:
      - dst_ip
  timespan: 600s
  condition:
      field: category
      gt: 30
level: medium
---
title: Brute Force
id: 53c7cca0-2901-493a-95db-d00d6fcf0a37
status: deprecated
description: Detects many authentication failures from one source to one destination which is may indicate Brute Force activity
author: Aleksandr Akhremchik, oscd.community
date: 2019/10/25
modified: 2022/11/04
logsource:
  category: authentication
detection:
  selection:
    action: failure
  condition: selection
fields:
  - src_ip
  - dst_ip
  - user
falsepositives:
  - Inventarization
  - Vulnerability scanner
  - Legitimate application
level: medium
tags:
  - attack.credential_access
  - attack.t1110
