title: Meta Rule Quick Execution of a Series of Suspicious Commands
id: f4532314-38eb-4b90-8f5f-ee832f4d6680
correlation:
    type: event_count
    rules:
        - 61ab5496-748e-4818-a92f-de78e20fe7f1
    group-by:
        - MachineName
    timespan: 5m
    condition:
        gt: 5
level: medium
---
title: Quick Execution of a Series of Suspicious Commands
id: 61ab5496-748e-4818-a92f-de78e20fe7f1
status: unsupported
description: Detects multiple suspicious process in a limited timeframe
references:
    - https://car.mitre.org/wiki/CAR-2013-04-002
author: juju4
date: 2019/01/16
modified: 2023/02/24
tags:
    - car.2013-04-002
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - arp.exe
            - at.exe
            - attrib.exe
            - cscript.exe
            - dsquery.exe
            - hostname.exe
            - ipconfig.exe
            - mimikatz.exe
            - nbtstat.exe
            - net.exe
            - netsh.exe
            - nslookup.exe
            - ping.exe
            - quser.exe
            - qwinsta.exe
            - reg.exe
            - runas.exe
            - sc.exe
            - schtasks.exe
            - ssh.exe
            - systeminfo.exe
            - taskkill.exe
            - telnet.exe
            - tracert.exe
            - wscript.exe
            - xcopy.exe
            - pscp.exe
            - copy.exe
            - robocopy.exe
            - certutil.exe
            - vssadmin.exe
            - powershell.exe
            - pwsh.exe
            - wevtutil.exe
            - psexec.exe
            - bcedit.exe
            - wbadmin.exe
            - icacls.exe
            - diskpart.exe
    condition: selection
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
level: low
