title: Meta Rule APT29 Google Update Service Install
id: 8a657050-cd0c-435e-a1bd-cfa557665b4d
correlation:
    type: temporal
    rules:
        - 170901d1-de11-4de7-bccb-8fa13678d857
        - 0af723a1-0222-4427-a07d-3be9bb8d12d7
    group-by:
        - computer
    timespan: 5m
level: medium
---
title: Silence.Downloader V3
id: 170901d1-de11-4de7-bccb-8fa13678d857
status: unsupported
description: Detects Silence downloader. These commands are hardcoded into the binary.
author: Alina Stepchenkova, Roman Rezvukhin, Group-IB, oscd.community
date: 2019/11/01
modified: 2023/02/24
tags:
    - attack.persistence
    - attack.t1547.001
    - attack.discovery
    - attack.t1057
    - attack.t1082
    - attack.t1016
    - attack.t1033
    - attack.g0091
logsource:
    category: process_creation
    product: windows
detection:
    selection_recon:
        Image|endswith:
            - '\tasklist.exe'
            - '\qwinsta.exe'
            - '\ipconfig.exe'
            - '\hostname.exe'
        CommandLine|contains: '>>'
        CommandLine|endswith: 'temps.dat'
    condition: selection_recon
fields:
    - ComputerName
    - User
    - Image
    - CommandLine
falsepositives:
    - Unknown
level: high
---
title: Silence.Downloader V3
id: 0af723a1-0222-4427-a07d-3be9bb8d12d7
status: unsupported
description: Detects Silence downloader. These commands are hardcoded into the binary.
author: Alina Stepchenkova, Roman Rezvukhin, Group-IB, oscd.community
date: 2019/11/01
modified: 2023/02/24
tags:
    - attack.persistence
    - attack.t1547.001
    - attack.discovery
    - attack.t1057
    - attack.t1082
    - attack.t1016
    - attack.t1033
    - attack.g0091
logsource:
    category: process_creation
    product: windows
detection:
    selection_persistence:
        CommandLine|contains: '/C REG ADD "HKCU\Software\Microsoft\Windows\CurrentVersion\Run" /v "WinNetworkSecurity" /t REG_SZ /d'
    condition: selection_persistence
fields:
    - ComputerName
    - User
    - Image
    - CommandLine
falsepositives:
    - Unknown
level: high
