title: Meta Rule Execution via CL_Mutexverifiers.ps1 (2 Lines)
id: 392cd8a5-b0f2-4387-86c2-85026cfea12d
correlation:
    type: value_count
    rules:
        - 6609c444-9670-4eab-9636-fe4755a851ce
    group-by:
        - Computer
    timespan: 10m
    condition:
        field: ScriptBlockText
        gt: 2
level: medium
---
title: Execution via CL_Mutexverifiers.ps1 (2 Lines)
id: 6609c444-9670-4eab-9636-fe4755a851ce
status: unsupported
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1 module
references:
    - https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
    - https://twitter.com/pabraeken/status/995111125447577600
author: oscd.community, Natalia Shornikova
date: 2020/10/14
modified: 2023/02/24
tags:
    - attack.defense_evasion
    - attack.t1216
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - 'CL_Mutexverifiers.ps1'
            - 'runAfterCancelProcess'
    condition: selection
    # PS > Import-Module c:\Windows\diagnostics\system\Audio\CL_Mutexverifiers.ps1
    # PS > runAfterCancelProcess c:\Evil.exe
falsepositives:
    - Unknown
level: high
