title: Meta Rule Failed Mounting of Hidden Share
id: 7b620ec9-b171-4094-912c-e6c04ceeea7f
correlation:
    type: event_count
    rules:
        - 1c3be8c5-6171-41d3-b792-cab6f717fcdb
    group-by:
        - Computer
    timespan: 1m
    condition:
        gt: 10
level: medium
---
title: Failed Mounting of Hidden Share
id: 1c3be8c5-6171-41d3-b792-cab6f717fcdb
status: unsupported
description: Detects repeated failed (outgoing) attempts to mount a hidden share
references:
    - https://twitter.com/moti_b/status/1032645458634653697
    - https://www.bsi.bund.de/SharedDocs/Downloads/EN/BSI/Cyber-Security/SiSyPHuS/AP10/Logging_Configuration_Guideline.pdf?__blob=publicationFile&v=5
author: Fabian Franz
date: 2022/08/30
modified: 2023/02/24
tags:
    - attack.t1021.002
    - attack.lateral_movement
logsource:
    product: windows
    service: smbclient-security
detection:
    selection:
        EventID: 31010
        ShareName|endswith: '$'
    condition: selection
fields:
    - ShareName
falsepositives:
    - Legitimate administrative activity
    - Faulty scripts
level: medium
