title: Meta Rule Rare Service Installations
id: 8aefbbd8-5361-402b-a87c-69a6c4adf794
correlation:
    type: event_count
    rules:
        - 66bfef30-22a5-4fcd-ad44-8d81e60922ae
    group-by:
        - ServiceName
    timespan: 7d
    condition:
        gt: 5
level: medium
---
title: Rare Service Installations
id: 66bfef30-22a5-4fcd-ad44-8d81e60922ae
status: unsupported
description: Detects rare service installs that only appear a few times per time frame and could reveal password dumpers, backdoor installs or other types of malicious services
author: Florian Roth (Nextron Systems)
date: 2017/03/08
modified: 2023/02/24
tags:
    - attack.persistence
    - attack.privilege_escalation
    - car.2013-09-005
    - attack.t1543.003
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: 'Service Control Manager'
        EventID: 7045
    condition: selection
falsepositives:
    - Software installation
    - Software updates
level: low
