title: Meta Rule Multiple Users Remotely Failing To Authenticate From Single Source
id: d8cb0e79-61c6-41e5-a95e-d9e65b3a09ee
correlation:
  type: value_count
  rules:
      - add2ef8d-dc91-4002-9e7e-f2702369f53a
  group-by:
      - IpAddress
  timespan: 24h
  condition:
      field: TargetUserName
      gt: 10
level: medium
---
title: Multiple Users Remotely Failing To Authenticate From Single Source
id: add2ef8d-dc91-4002-9e7e-f2702369f53a
status: unsupported
description: Detects a source system failing to authenticate against a remote host with multiple users.
references:
    - https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
author: Mauricio Velazco
date: 2021/06/01
modified: 2023/02/24
tags:
    - attack.t1110.003
    - attack.initial_access
    - attack.privilege_escalation
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 4625
        LogonType: 3
    filter:
        IpAddress: '-'
    condition: selection1 and not filter 
falsepositives:
    - Terminal servers
    - Jump servers
    - Other multiuser systems like Citrix server farms
    - Workstations with frequently changing users
level: medium
