title: Meta Rule Rare Schtasks Creations
id: 6b33b33f-857d-4359-8f2f-64502d22ba84
correlation:
    type: event_count
    rules:
        - b0d77106-7bb0-41fe-bd94-d1752164d066
    group-by:
        - TaskName
    timespan: 7d
    condition:
        lt: 5
level: low
---
title: Rare Schtasks Creations
id: b0d77106-7bb0-41fe-bd94-d1752164d066
status: unsupported
description: Detects rare scheduled tasks creations that only appear a few times per time frame and could reveal password dumpers, backdoor installs or other types of malicious code
author: Florian Roth (Nextron Systems)
date: 2017/03/23
modified: 2023/02/24
tags:
    - attack.execution
    - attack.privilege_escalation
    - attack.persistence
    - car.2013-08-001
    - attack.t1053.005
logsource:
    product: windows
    service: security
    definition: 'The Advanced Audit Policy setting Object Access > Audit Other Object Access Events has to be configured to allow this detection (not in the baseline recommendations by Microsoft). We also recommend extracting the Command field from the embedded XML in the event data.'
detection:
    selection:
        EventID: 4698
    condition: selection
falsepositives:
    - Software installation
    - Software updates
level: low
