title: Meta Rule Invalid Users Failing To Authenticate From Single Source Using NTLM
id: 0da075e6-88e7-4e37-8834-c418f8ebb642
correlation:
  type: value_count
  rules:
      - 56d62ef8-3462-4890-9859-7b41e541f8d5
  group-by:
      - Workstation
  timespan: 24h
  condition:
      field: TargetUserName
      gt: 10
level: medium
---
title: Invalid Users Failing To Authenticate From Single Source Using NTLM
id: 56d62ef8-3462-4890-9859-7b41e541f8d5
status: unsupported
description: Detects failed logins with multiple invalid domain accounts from a single source system using the NTLM protocol.
references:
    - https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
author: Mauricio Velazco
date: 2021/06/01
modified: 2023/03/13
tags:
    - attack.t1110.003
    - attack.initial_access
    - attack.privilege_escalation
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 4776
        Status: '*0xC0000064' # The username you typed does not exist. Bad username.
    filter:
        TargetUserName: '*$'
    timeframe: 24h
    condition: selection1 and not filter
falsepositives:
    - Terminal servers
    - Jump servers
    - Other multiuser systems like Citrix server farms
    - Workstations with frequently changing users
level: medium
