title: Meta Rule Invalid Users Failing To Authenticate From Source Using Kerberos
id: afc224b1-17a3-4cae-8797-72d39d84eb7f
correlation:
  type: value_count
  rules:
      - bc93dfe6-8242-411e-a2dd-d16fa0cc8564
  group-by:
      - IpAddress
  timespan: 24h
  condition:
      field: TargetUserName
      gt: 10
level: medium
---
title: Invalid Users Failing To Authenticate From Source Using Kerberos
id: bc93dfe6-8242-411e-a2dd-d16fa0cc8564
status: unsupported
description: Detects failed logins with multiple invalid domain accounts from a single source system using the Kerberos protocol.
references:
    - https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
author: Mauricio Velazco, frack113
date: 2021/06/01
modified: 2023/03/13
tags:
    - attack.t1110.003
    - attack.initial_access
    - attack.privilege_escalation
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4768
        Status: '0x6'
    filter_computer:
        TargetUserName|endswith: '$'
    condition: selection and not filter_computer
falsepositives:
    - Vulnerability scanners
    - Misconfigured systems
    - Remote administration tools
    - VPN terminators
    - Multiuser systems like Citrix server farms
level: medium
