title: Meta Rule Enumeration via the Global Catalog
id: 773c0f44-fc23-4310-8902-036e3950369d
correlation:
    type: event_count
    rules:
        - 619b020f-0fd7-4f23-87db-3f51ef837a34
    group-by:
        - SourceAddress
    timespan: 1h
    condition:
        gt: 2000
level: low
---
title: Enumeration via the Global Catalog
id: 619b020f-0fd7-4f23-87db-3f51ef837a34
status: unsupported
description: Detects enumeration of the global catalog (that can be performed using BloodHound or others AD reconnaissance tools). Adjust Threshold according to domain width.
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5156
author: Chakib Gzenayi (@Chak092), Hosni Mribah
date: 2020/05/11
modified: 2023/02/24
tags:
    - attack.discovery
    - attack.t1087.002
logsource:
    product: windows
    service: security
    definition: 'The advanced audit policy setting "Windows Filtering Platform > Filtering Platform Connection" must be configured for Success'
detection:
    selection:
        EventID: 5156
        DestPort:
            - 3268
            - 3269
    condition: selection
falsepositives:
    - Exclude known DCs.
level: medium
